# NoRunsRamp Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..NoRunsRamp Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Ramp has no Runs. Can't create Ramp.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoRunsRamp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoRunsRamp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoRunsRamp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace